//
//  Data.swift
//  TestApp
//
//  Created by Ильнур Закиров on 21.02.2023.
//

import Foundation

class MetaData {
    
    static let news: [NewsModel] = [
        NewsModel(id: 1,
                  image: "newsImage1",
                  date: "22 сентября",
                  title: "Заголовок первой новости",
                  description: "Мы нашли в интернете фото, которое может быть сделано в городе, где родился и вырос наш герой. На нем изображен памятник, который находится у здания, где учился наш герой, а также возле него стоят его одноклассники.",
                  isLiked: false),
        NewsModel(id: 2,
                  image: "newsImage2",
                  date: "31 августа",
                  title: "Заголовок второй новости",
                  description: "В США за последние полгода произошел целый ряд изменений в отношении к российским фондовым инструментам. Индекс NASDAQ вырос с начала года на 14%, а индекс Dow Jones (который также включает в себя акции компаний из России) – на 12%. Это стало возможным благодаря росту стоимости нефти, которая в последние месяцы резко подорожала. По данным Bloomberg, в январе-феврале стоимость барреля нефти марки Brent выросла на 11%. Сейчас нефть марки Brent торгуется по цене $66 за баррель.",
                  isLiked: false),
        NewsModel(id: 3,
                  image: "newsImage3",
                  date: "13 июля",
                  title: "Заголовок третьей новости",
                  description: "В этом году для нас, студентов-медиков, была организована поездка в город Казань. Как же мы обрадовались! Мы не были на родине великого поэта и великого композитора и в этом году мы смогли наверстать упущенное. В первую очередь мы посетили Казанский Кремль. И конечно, не могли не прогуляться по улице Баумана, это главная пешеходная улица Казани. На улице Баумана расположено много магазинов, кафе, ресторанов. Здесь же расположена знаменитая мечеть Кул Шариф.",
                  isLiked: false),
        NewsModel(id: 4,
                  image: "newsImage4",
                  date: "05 мая",
                  title: "Заголовок четвертой новости",
                  description: "Опасность на дороге В связи с наступлением весенне-летнего периода, когда увеличивается количество дорожно-транспортных происшествий с участием детей, ГИБДД просит родителей и педагогов усилить контроль за детьми. На дорогах уже появились первые пешеходы, а это значит, что детям пора выходить на улицу. Не секрет, что дети часто нарушают правила дорожного движения, и это не всегда является следствием незнания. Зачастую они просто не понимают, с чем могут столкнуться на дороге.",
                  isLiked: false)
    ]
}
